START = 'Привіт, це бот Радіо КПІ.\n' \
        'Ти можеш:\n' \
        '📝 Замовити пісню\n' \
        '🖌 Поставити будь-яке запитання, що-небудь запропонувати, запропонувати свою кандидатуру до наших лав\n' \
        '🎧 Дізнатися, що грає зараз, грало чи гратиме\n' \
        '⏱ Дізнатися коли в улюбленому ЗВО перерви\n' \
        '\n⁉️ Радимо насамперед прочитати інструкцію /help'

MENU = 'Вибери, що хочеш зробити 😜'

FEEDBACK = 'Пиши сюди все що хочеш чи реплай на повідомлення від нас і ми відповімо тобі) \n' \
           'Ну ще у нас є чат @rhub_kpi \n (⛔️ /cancel)'
FEEDBACK_THANKS = 'Дякуємо за повідомлення!'

ORDER_CHOOSE_SONG = 'Що ти хочеш почути?\n' \
                    '➖ Напиши назву пісні та бот її знайде 🔎\n' \
                    '➖ Скинь посилання на трек із music.youtube.com\n' \
                    '➖ Завантаж або перейшли аудіофайл\n' \
                    '➖ Скористайтеся інлайн пошуком нижче\n' \
                    '➖ Використовуй інших ботів для пошуку та перейшли аудіо сюди (@vkm4bot, @LyBot)\n' \
                    '\n⛔️ /cancel для скасування'

ORDER_INLINE_SEARCH = 'Натисни кнопку для інлайн-пошуку в нашому боті 👀'

CHOOSE_DAY = 'Вибери день'
CHOOSE_TIME = '{0}, відмінно. Тепер вибери час'

ORDER_ON_MODERATION = 'Дякуємо за замовлення ({0}), чекайте на модерацію!'
ORDER_ACCEPTED = 'Ваше замовлення "<b>{0}</b>", ({1}) прийняте!'
ORDER_ACCEPTED_UPNEXT = 'Ваше замовлення "<b>{0}</b>" прийняте та заграє {1}'
ORDER_ACCEPTED_TOOLATE = 'Ми хотіли прийняти ваше замовлення "<b>{0}</b>", ({1}), але воно вже не влізе в ефір(( ' \
                             'Бажаєте перезамовлення?'

ORDER_DENIED = 'Ваше замовлення "<b>{0}</b>", ({1}) відхилено('

ORDER_CANCELED = 'Ну ок'

ORDER_PLAYING = 'Ваше замовлення "<b>{0}</b>" заграло! \n /notify - вимкнути сповіщення'
ORDER_PEREZAKLAD = 'Ваше замовлення не встигло заграти на цьому ефірі. Бажаєте перезамовлення?'
ORDER_ERR_TOOLATE = 'На цей час вже точно не встигне'
ORDER_ERR_TOOMUCH = 'Ви замовили забагато треків на цей ефір'

HISTORY_TITLE = 'Замовил(а) {0}'

PLAYLIST_NOW = '⏮ <b>Попередній трек: </b> {0}\n' \
               '▶ <b>Зараз грає: </b> {1}\n' \
               '⏭ <b>Наступний трек: </b> {2}'

PLAYLIST_NOW_NOTHING = 'На Політехнічній наразі нічого не грає. Зате грає на *вставити посилання на ютуб*'  # todo

BAN_TRY_ORDER = 'Ви не можете пропонувати музику до {0}'
BAN_YOU_BANNED = 'Ви були забанені на {0}. {1}'

SEARCH_FAILED = 'Нічого не знайшов( \n Можеш завантажити аудіо сам або переслати від іншого бота!'
ERROR = 'Не вийшло('
UNKNOWN_CMD = 'Що ти хочеш? Для замовлення пісні не забувай натискати кнопку "Замовити пісню". Допомога тут /help'

SOMETHING_BAD_IN_ORDER = '<i>Упс..</i> Є деяка <b>імовірність</b>, що цей трек порушує правила: \n' \
                         '{} \n\n Якщо ви вважаєте, що все ок - натисніть кнопку "<code>Все ок</code>"'

BAD_ORDER_SHORT = 'Трек занадто короткий. (<60 с)'
BAD_ORDER_LONG = 'Трек занадто довгий (>6 хв). Краще не замовляти його на перерви'
BAD_ORDER_BADWORDS = 'Імовірно, трек містить мати'
BAD_ORDER_ANIME = 'Імовірно, трек є аніме опенінгом'
BAD_ORDER_PERFORMER = 'Імовірно, трек є "не форматом радіо"'

HASHTAG_MODERATE = '#відмодерити'

HELP = {
    'orders': '''
📝 Є 3 способи <b>замовити пісню:</b>

- Натиснути на кнопку <code>Замовити пісню</code> та ввести назву, бот вибере найімовірніший варіант

- Використовувати інлайн режим пошуку (ввести <code>@kpiradio_bot</code> або натиснути на відповідну кнопку).
    У цьому випадку ти можеш вибрати із 50 знайдених варіантів, з можливістю спочатку послухати

- Завантажити або надіслати боту бажану пісню
Після цього необхідно вибрати день та час для замовлення.''',

    'criteria': '''
✅ Вітаються нейтральні, спокійні пісні, які не відволікатимуть від навчального процесу.

⚠️ Будь ласка, не замовляйте багато пісень одразу. Не замовляйте більше 1 треку на ефір, окрім вечірнього.

❌ Відхиляються:
    - биті треки, треки завдовжки менше 1 хвилини
    - треки довжиною понад 6 хвилин, крім вечірнього ефіру
    - лайви, ремікси поганої якості
    - двічі та більше замовлений трек на один ефір
    - треки з матами, поганим змістом
    - треки з невідповідною назвою
    - не формат радіо (див. нижче)

Скільки людей, стільки та смаків. Але ми найчастіше відхиляємо:
    - російський реп
    - треки з елементами скріму, жорстокого металу
    - гачі, стогін, аніме опенінги
    - кавери (radio tapok)
    - таких виконавців як Корж, Команда Білоруських та подібні

❗️ Рупора радіо – не колонки у клубі. Пам'ятайте про це.
️Модератори мають право відхилити ваш трек без пояснення причин.''',

    'playlist': '''
<b>⏭ Плейлист радіо:</b>

- Дізнатися, що грає зараз, грало до цього або буде грати можна натиснувши на кнопку "<code>Що грає</code>"

- Пам'ятаєте дату та час коли грала пісня та хочете її знайти? Можете знайти її там же - "<code>Що грало?</code>"

- Хочете дізнатися, що буде грати в майбутньому? "<code>Що гратиме</code>"!

- Замовлення <b>одноразове</b>. Якщо ваша пісня не встигла увійти в ефір - <b>перезамовте наступного разу</b>.''',

    'feedback': '''
  <b>🖌 Зворотній зв'язок:</b>

- Ви завжди можете написати команді адмінів, що ви думаєте про них і про радіо

- Якщо хочете стати частиною радіо - пишіть про це і готуйтеся до анкет

- Вважаєте щось незручним? Є пропозиції щодо покращення? Не замислюючись, пиши нам.

- У нас є чат @rhub_kpi''',

    'start': 'Виберіть тему, що вас цікавить. (Радимо прочитати все)'
}
